gdt_base:
dd 0,0

;#1，这里指向可执行代码段，段选择子0x8
;从高地址向底地址排列
;00 40 98 00 7e 00 01 ff
;00000000 01000000 10011010 00000000 01111110 00000000 00000001 11111111
;段地址：0x00007e00，最大偏移量：0x1e00，因此现在32位模式下，只有0x7e00~0x8000内的代码被允许执行
;G=0,D=1,L=0,AVL=0
;P=1,DPL=00,S=1,TYPE=1010
;段基地址：0x00007e00
;段界限：0x001ff
dd 0x7e001e00
dd 0x00409a00

;#2,这里指向字符显示缓冲区
;0x10
dd 0x8000ffff
dd 0x0040920b

;#3,堆栈
;0x18
dd 0x00000000
dd 0x00409600

;#4
;数据区放0x00009000，偏移量0x200字节
;ff 01 00 90 00 92 40 00
;0x20
dd 0x900001ff
dd 0x00409200

;#5,0x28
;内核位置，数据段
dd 0x000001ff
dd 0x00409200

;#6,0x
;重设为代码段
dd 0x000001ff
dd 0x00409a00